results/test11_burst_read/fio-test11-burst-read-p1-100g-10.log
Starting FIO benchmark on pod 10...
FIO Configuration:
[global]
ioengine=libaio
direct=1
fallocate=none
size=10G
runtime=600
ramp_time=60
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=4
iodepth=16

refill_buffers=1
scramble_buffers=1
randrepeat=0
norandommap=1

[test11-burst-read-phase1]
rw=randrw
rwmixread=90
bs=256k
rate=350m,25m
---
test11-burst-read-phase1: (g=0): rw=randrw, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=16
...
fio-3.41
Starting 4 processes
test11-burst-read-phase1: Laying out IO file (1 file / 10240MiB)
test11-burst-read-phase1: Laying out IO file (1 file / 10240MiB)
test11-burst-read-phase1: Laying out IO file (1 file / 10240MiB)
[...]

test11-burst-read-phase1: (groupid=0, jobs=4): err= 0: pid=76: Mon Mar 16 22:04:47 2026
  read: IOPS=4986, BW=1247MiB/s (1307MB/s)(730GiB/600013msec)
    slat (usec): min=10, max=3551, avg=48.47, stdev=26.55
    clat (usec): min=639, max=307555, avg=8117.09, stdev=6164.98
     lat (usec): min=678, max=307613, avg=8165.56, stdev=6165.50
    clat percentiles (usec):
     |  1.00th=[  1074],  5.00th=[  1582], 10.00th=[  1876], 20.00th=[  2442],
     | 30.00th=[  3326], 40.00th=[  4817], 50.00th=[  7701], 60.00th=[ 10159],
     | 70.00th=[ 11731], 80.00th=[ 13042], 90.00th=[ 14615], 95.00th=[ 16188],
     | 99.00th=[ 21627], 99.50th=[ 27919], 99.90th=[ 60556], 99.95th=[ 72877],
     | 99.99th=[119014]
   bw (  MiB/s): min=   46, max= 2534, per=100.00%, avg=1249.87, stdev=59.71, samples=4790
   iops        : min=  184, max=10136, avg=4999.18, stdev=238.85, samples=4790
  write: IOPS=399, BW=100.0MiB/s (105MB/s)(58.6GiB/600013msec); 0 zone resets
    slat (usec): min=11, max=2607, avg=52.16, stdev=28.35
    clat (usec): min=1174, max=533594, avg=14713.79, stdev=22561.55
     lat (usec): min=1214, max=533647, avg=14765.96, stdev=22562.59
    clat percentiles (usec):
     |  1.00th=[  1663],  5.00th=[  2089], 10.00th=[  2507], 20.00th=[  3654],
     | 30.00th=[  5669], 40.00th=[  9372], 50.00th=[ 11600], 60.00th=[ 13042],
     | 70.00th=[ 14353], 80.00th=[ 16188], 90.00th=[ 22152], 95.00th=[ 40633],
     | 99.00th=[121111], 99.50th=[162530], 99.90th=[263193], 99.95th=[304088],
     | 99.99th=[392168]
   bw (  KiB/s): min=51712, max=154624, per=100.00%, avg=102426.25, stdev=1324.02, samples=4800
   iops        : min=  202, max=  604, avg=399.99, stdev= 5.17, samples=4800
  lat (usec)   : 750=0.01%, 1000=0.58%
  lat (msec)   : 2=10.98%, 4=22.73%, 10=23.47%, 20=40.14%, 50=1.63%
  lat (msec)   : 100=0.31%, 250=0.14%, 500=0.01%, 750=0.01%
  cpu          : usr=1.26%, sys=7.84%, ctx=3375857, majf=0, minf=5571
  IO depths    : 1=6.4%, 2=12.9%, 4=16.0%, 8=5.5%, 16=59.2%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2992091,239998,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=1247MiB/s (1307MB/s), 1247MiB/s-1247MiB/s (1307MB/s-1307MB/s), io=730GiB (784GB), run=600013-600013msec
  WRITE: bw=100.0MiB/s (105MB/s), 100.0MiB/s-100.0MiB/s (105MB/s-105MB/s), io=58.6GiB (62.9GB), run=600013-600013msec
FIO benchmark completed on pod 10