results/test11_burst_read/fio-test11-burst-read-p2-100g-1.log
Starting FIO benchmark on pod 1...
FIO Configuration:
[global]
ioengine=libaio
direct=1
fallocate=none
size=10G
runtime=90
ramp_time=60
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=8
iodepth=4

refill_buffers=1
scramble_buffers=1
randrepeat=0
norandommap=1

[test11-burst-read-phase2]
rw=randread
bs=512k
# 10,000 MB/s per pod / 8 threads = 1250m per thread
rate=1250m
---
test11-burst-read-phase2: (g=0): rw=randread, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=4
...
fio-3.41
Starting 8 processes
test11-burst-read-phase2: Laying out IO file (1 file / 10240MiB)
test11-burst-read-phase2: Laying out IO file (1 file / 10240MiB)
test11-burst-read-phase2: Laying out IO file (1 file / 10240MiB)
[...]

test11-burst-read-phase2: (groupid=0, jobs=8): err= 0: pid=76: Mon Mar 16 22:02:13 2026
  read: IOPS=5792, BW=2896MiB/s (3037MB/s)(255GiB/90010msec)
    slat (usec): min=19, max=3309, avg=90.14, stdev=41.16
    clat (usec): min=856, max=91208, avg=5431.73, stdev=5149.27
     lat (usec): min=941, max=91275, avg=5521.87, stdev=5151.93
    clat percentiles (usec):
     |  1.00th=[ 1614],  5.00th=[ 1827], 10.00th=[ 1958], 20.00th=[ 2147],
     | 30.00th=[ 2343], 40.00th=[ 2573], 50.00th=[ 2933], 60.00th=[ 3523],
     | 70.00th=[ 5014], 80.00th=[ 9241], 90.00th=[11731], 95.00th=[18482],
     | 99.00th=[23200], 99.50th=[24773], 99.90th=[27657], 99.95th=[29230],
     | 99.99th=[42206]
   bw (  MiB/s): min= 1989, max= 3731, per=100.00%, avg=2897.25, stdev=49.95, samples=1440
   iops        : min= 3979, max= 7463, avg=5794.06, stdev=99.90, samples=1440
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=12.10%, 4=52.79%, 10=18.85%, 20=12.89%, 50=3.37%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.45%, sys=7.28%, ctx=519615, majf=0, minf=3411
  IO depths    : 1=0.0%, 2=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=521338,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=2896MiB/s (3037MB/s), 2896MiB/s-2896MiB/s (3037MB/s-3037MB/s), io=255GiB (273GB), run=90010-90010msec
FIO benchmark completed on pod 1