results/test11_burst_read/fio-test11-burst-read-p2-100g-4.log
Starting FIO benchmark on pod 4...
FIO Configuration:
[global]
ioengine=libaio
direct=1
fallocate=none
size=10G
runtime=90
ramp_time=60
time_based=1
group_reporting=1
directory=/mnt/fio-data
numjobs=8
iodepth=4

refill_buffers=1
scramble_buffers=1
randrepeat=0
norandommap=1

[test11-burst-read-phase2]
rw=randread
bs=512k
# 10,000 MB/s per pod / 8 threads = 1250m per thread
rate=1250m
---
test11-burst-read-phase2: (g=0): rw=randread, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=4
...
fio-3.41
Starting 8 processes
test11-burst-read-phase2: Laying out IO file (1 file / 10240MiB)
test11-burst-read-phase2: Laying out IO file (1 file / 10240MiB)
test11-burst-read-phase2: Laying out IO file (1 file / 10240MiB)
[...]

test11-burst-read-phase2: (groupid=0, jobs=8): err= 0: pid=76: Mon Mar 16 22:01:55 2026
  read: IOPS=5950, BW=2975MiB/s (3120MB/s)(262GiB/90013msec)
    slat (usec): min=20, max=3438, avg=80.98, stdev=39.50
    clat (usec): min=481, max=122585, avg=5293.95, stdev=3565.17
     lat (usec): min=562, max=122668, avg=5374.93, stdev=3566.83
    clat percentiles (usec):
     |  1.00th=[ 1663],  5.00th=[ 1876], 10.00th=[ 2008], 20.00th=[ 2278],
     | 30.00th=[ 2769], 40.00th=[ 3556], 50.00th=[ 4293], 60.00th=[ 5080],
     | 70.00th=[ 6128], 80.00th=[ 7635], 90.00th=[10814], 95.00th=[12649],
     | 99.00th=[15926], 99.50th=[17171], 99.90th=[21365], 99.95th=[26346],
     | 99.99th=[49546]
   bw (  MiB/s): min= 1965, max= 3852, per=100.00%, avg=2976.33, stdev=51.17, samples=1440
   iops        : min= 3930, max= 7704, avg=5952.12, stdev=102.36, samples=1440
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=9.42%, 4=36.52%, 10=42.16%, 20=11.76%, 50=0.13%
  lat (msec)   : 100=0.01%, 250=0.01%
  cpu          : usr=0.47%, sys=6.74%, ctx=534211, majf=0, minf=310
  IO depths    : 1=0.0%, 2=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=535583,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=2975MiB/s (3120MB/s), 2975MiB/s-2975MiB/s (3120MB/s-3120MB/s), io=262GiB (281GB), run=90013-90013msec
FIO benchmark completed on pod 4